# hi.py

HI = {
    "welcome": "🎀 *Velvetta YouTube Downloader Bot में आपका स्वागत है!* 🎀\nडाउनलोड शुरू करने के लिए हमारे चैनल को सब्सक्राइब करें! 🎉",
    "subscribe_button": "🔔 चैनल सब्सक्राइब करें",
    "channel_url": "https://t.me/Velvetabots",
    
    "daily_limit_reached": "ओह नहीं! 😔 आप आज की डेली डाउनलोड लिमिट को पार कर चुके हैं।\n\nडाउनलोड में रुकावट न आए, अभी प्रीमियम लें और पाएँ:\n* 🚀 अनलिमिटेड डाउनलोड्स\n* 🔗 एक्सक्लूसिव Instagram डाउनलोडर एक्सेस\n* ⚡ सुपर-फास्ट स्पीड्स और बहुत कुछ!\n\nसिर्फ ₹49 में 60 दिनों के लिए – आज ही अपग्रेड करें!",
    "payment_button": "💎 प्रीमियम खरीदें",
    
    "send_payment_screenshot": "📸 कृपया अपने पेमेंट की स्क्रीनशॉट यहाँ भेजें। वेरिफिकेशन के बाद प्रीमियम एक्सेस दिया जाएगा।",
    
    "help_text": "🤖 *Velvetta Downloader Bot कैसे इस्तेमाल करें:*\n\n1. कोई भी YouTube लिंक भेजें।\n2. वीडियो प्रोसेस होने का इंतजार करें।\n3. क्वालिटी चुनें और डाउनलोड करें।\n\n🚫 *डेली लिमिट:* 5 डाउनलोड/दिन\n💎 अनलिमिटेड एक्सेस के लिए प्रीमियम लें।",
    
    "profile_info": "👤 *आपकी प्रोफ़ाइल:*\n\n🆔 आईडी: `{id}`\n📛 नाम: `{name}`\n📊 आज के डाउनलोड: `{downloads}/5`\n💎 प्रीमियम: `{premium}`\n⏰ वैधता समाप्ति: `{valid}`",
    
    "support_text": "🛠 सहायता के लिए हमारे डेवलपर से संपर्क करें:\n[👨‍💻 Yaswanth V N S](https://t.me/Yaswanth_venkata_naga_sai)",
}
