# te.py

TE = {
    "welcome": "🎀 *Velvetta YouTube Downloader Botకి స్వాగతం!* 🎀\nడౌన్‌లోడ్ ప్రారంభించడానికి మా ఛానల్‌కి సభ్యత్వం పొందండి! 🎉",
    "subscribe_button": "🔔 ఛానల్ సబ్‌స్క్రైబ్ చేయండి",
    "channel_url": "https://t.me/Velvetabots",
    
    "daily_limit_reached": "ఓహ్ కాదు! 😔 మీరు ఈరోజు మీ డైలీ డౌన్‌లోడ్ పరిమితిని చేరుకున్నారు.\n\nమీ డౌన్లోడ్‌లను ఆపకండి! ✨ ప్రీమియం తీసుకోండి:\n* 🚀 అన్లిమిటెడ్ డౌన్‌లోడ్‌లు\n* 🔗 ప్రత్యేక Instagram లింక్ డౌన్లోడర్ యాక్సెస్\n* ⚡ వేగవంతమైన స్పీడ్‌లు మరియు మరిన్ని!\n\nకేవలం ₹49కి 60 రోజులపాటు – ఇప్పుడే అప్గ్రేడ్ అవ్వండి!",
    "payment_button": "💎 ప్రీమియం కొనండి",
    
    "send_payment_screenshot": "📸 దయచేసి మీ లావాదేవీ స్క్రీన్‌షాట్‌ను పంపండి. ధృవీకరణ తర్వాత ప్రీమియం యాక్సెస్ ఇవ్వబడుతుంది.",
    
    "help_text": "🤖 *Velvetta Downloader Bot వాడే విధానం:*\n\n1. ఏ YouTube లింక్ అయినా పంపండి.\n2. వీడియో ప్రాసెస్ అవ్వడం కోసం వేచి ఉండండి.\n3. మీకు కావలసిన క్వాలిటీ ఎంచుకుని డౌన్‌లోడ్ చేయండి.\n\n🚫 *డైలీ పరిమితి:* రోజుకు 5 డౌన్‌లోడ్‌లు\n💎 అన్లిమిటెడ్ యాక్సెస్ కోసం ప్రీమియం తీసుకోండి.",
    
    "profile_info": "👤 *మీ ప్రొఫైల్:*\n\n🆔 ఐడీ: `{id}`\n📛 పేరు: `{name}`\n📊 నేటి డౌన్‌లోడ్‌లు: `{downloads}/5`\n💎 ప్రీమియం: `{premium}`\n⏰ చెల్లుబాటు గడువు: `{valid}`",
    
    "support_text": "🛠 సహాయం కోసం మా డెవలపర్‌ను సంప్రదించండి:\n[👨‍💻 Yaswanth V N S](https://t.me/Yaswanth_venkata_naga_sai)",
}
